Tutorials/plungingBreaker/stressOmega/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            streamFunction;
    N                   32;
    Tsoft               0;
    depth               0.4;
    phi                 0;
    height              0.128;

    specifyPeriod       true;
    period              5.0000046052168;

    specifyEuler        false;
    stokesVelocity      0;

    omega               1.2566359040198;
    waveNumber          (0.5941825 0 0);
    uBar                2.1305214377639;
    A                   nonuniform List<scalar>
    32
    (
        0.035917079348517
        0.026971511278101
        0.017906451300737
        0.01107923912266
        0.006615694672933
        0.0038926424120535
        0.002284483302689
        0.0013466283507172
...
    );
    B                   nonuniform List<scalar>
    32
    (
        0.17242239156954
        0.13061104345681
        0.08708463407889
        0.053222362715012
        0.030485824493466
        0.016511323758279
        0.0084621648610137
        0.0040830883559463
...
    );

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -24.7 0 -1 );
        endX                ( -14.7 0 1 );
        orientation         ( 1 0 0 );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               5;
}



// ************************************************************************* //
