Tutorials/plungingBreaker/stressOmega/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
366376
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    inlet
    {
        type            waveAlpha;
        refValue        nonuniform List<scalar> 
82
(
1
1
1
1
1
1
1
1
...
)
;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           nonuniform List<scalar> 
82
(
1
1
1
1
1
1
1
1
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
