Tutorials/plungingBreaker/stressOmega/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.39795e-08;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1.39795e-08;
        value           uniform 1.39795e-08;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.39795e-08;
        value           uniform 1.39795e-08;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.39795e-08;
        value           uniform 1.39795e-08;
    }
    bottom
    {
        type            epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 1.39795e-08;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
